---
kind: property
id: P:Autodesk.Revit.DB.Visual.Checker.TextureRealWorldScaleX
source: html/a4bf1138-cf2a-736a-c40e-379c2148d25d.htm
---
# Autodesk.Revit.DB.Visual.Checker.TextureRealWorldScaleX Property

The property labeled "Size X" from the "Checker" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldScaleX { get; }
```

## Remarks
This property is of type "AssetPropertyDistance" with a minimum of "0.01".